---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.MissingCurrentConstraintForHandle
source: html/d4162e28-aee6-3c60-5459-ed57d6381456.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.MissingCurrentConstraintForHandle Property

The current handle has no constraint. Please select a valid target to apply a new constraint.

## Syntax (C#)
```csharp
public static FailureDefinitionId MissingCurrentConstraintForHandle { get; }
```